tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/hotRoom/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

compileApplication ../../setHotRoom
runApplication blockMesh
runApplication setHotRoom
runApplication $application
